In [2]:
import pandas as pd
import seaborn as sns

In [3]:
df=sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [4]:
df.drop(['sibsp','parch','embarked','class','who','adult_male','deck','embark_town','alive','alone'],axis='columns',inplace=True)
df.head()

   survived  pclass     sex   age     fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [5]:
inputs = df.drop('survived',axis='columns')
target = df.survived

In [7]:
dummies = pd.get_dummies(inputs.sex)
dummies.head(10)

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1
5       0     1
6       0     1
7       0     1
8       1     0
9       1     0

In [8]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   pclass     sex   age     fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [9]:
inputs.drop(['sex','male'],axis='columns',inplace=True)
inputs.head(3)

   pclass   age     fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [10]:
inputs.columns[inputs.isna().any()]

Index(['age'], dtype='object')

In [11]:
inputs.age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

In [12]:
inputs.age = inputs.age.fillna(inputs.age.mean())
inputs.head()

   pclass   age     fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [37]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3,random_state=10)

In [38]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [39]:
model.fit(X_train,y_train)

GaussianNB()

In [40]:
model.score(X_test,y_test)

0.8059701492537313

In [42]:
X_test[0:10]

     pclass   age      fare  female
590       3  35.0    7.1250       0
131       3  20.0    7.0500       0
628       3  26.0    7.8958       0
195       1  58.0  146.5208       1
230       1  35.0   83.4750       1
646       3  19.0    7.8958       0
75        3  25.0    7.6500       0
586       2  47.0   15.0000       0
569       3  32.0    7.8542       0
287       3  22.0    7.8958       0

In [ ]:
y_test[0:10]

In [43]:
model.predict(X_test[0:10])

array([0, 0, 0, 1, 1, 0, 0, 0, 0, 0], dtype=int64)

In [44]:
model.predict_proba(X_test[:10])

array([[9.58081706e-01, 4.19182944e-02],
       [9.54611200e-01, 4.53888002e-02],
       [9.57799697e-01, 4.22003028e-02],
       [2.83651155e-04, 9.99716349e-01],
       [2.51214754e-02, 9.74878525e-01],
       [9.54115147e-01, 4.58848527e-02],
       [9.57401477e-01, 4.25985230e-02],
       [9.07071629e-01, 9.29283708e-02],
       [9.58609767e-01, 4.13902330e-02],
       [9.56084206e-01, 4.39157941e-02]])

**Calculate the score using cross validation**

In [41]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=5)

array([0.744     , 0.76      , 0.736     , 0.73387097, 0.80645161])